const baseUrl = window.location.origin;
const path = '/home/getValues'; // json 경로
const url = baseUrl + path;

// function fetchJson(url){
//     fetch(url)
//         .then(function (res) {
//             return res.json();
//         })
//         .then(function (json) {
//             if (!json.success) {
//                 console.log('서버에서 데이터를 가져오는데 실패하였습니다.');
//             } else{
    const json = {"success":true,"timestamp":1705652549210,"data":[[{"itemname":["열생산량 및 판매량"],"category":["구분","전년","계획","실적","계획대비","전년대비"],"row0":["외기온도","6.2","6.3","6.4","6.5","6.6"],"row1":["열생산량","311","311","311","311","311"],"row2":["계","315","315","315","315","315"],"row3":["자체공급","181","181","181","181","181"],"row4":["연계공급","131","131","131","131","131"],"row5":["연계수열","-","-","-","-","-"],"row6":["열판매량","171","171","171","171","171"]},{"itemname":["전일 열공급 및 판매실적"],"row0":["열생산량","7,125"],"row1":["CHP","35"],"row2":["연돌","458"],"row3":["자원회수","1,156"],"row4":["PLb","1"],"row5":["태양열","485"],"row6":["열공급량","7,125"],"row7":["지역공급","35"],"row8":["지역판매","458"],"row9":["강남연계","1,156"],"row10":["용인연계","1"],"row11":["판교연계","485"]},{"itemname":["대기오염정보 관리시스템"],"category":["구분","운전수치","사내규제치","법정규제치"],"row0":["Nox","220","225","250"],"row1":["Sox","120","130","180"],"row2":["Dust","25","30","50"]},{"itemname":["크리티컬포인트 운영현황1"],"category":["공급온도","회수온도","공급압력","회수압력","차압"],"row0":["삼부수진","35","35","12,341,234","12,341,234","1,234"],"row1":["야탑SK-VIEW","485","485","3,154","3,154","3,154"],"row2":["탑마을선경","1,156","1,156","153","153","153"],"row3":["파크타운롯데","1","1","5,152","5,152","5,152"],"row4":["무지개제일","485","485","153","153","153"],"row5":["벤처타운인텔리지","672","672","5,250","5,250","5,250"]},{"itemname":["크리티컬포인트 운영현황2"],"category":["S.T","R.T","D.P"],"row0":["수진삼부","234","234","234"],"row1":["탑마을선경","234","234","234"],"row2":["벤치타운","234","234","234"],"row3":["야탑","234","234","234"],"row4":["파크타운","234","234","234"],"row5":["무지개","234","234","234"]},{"itemname":["환영 문구"],"row0":["홍길동님"],"row1":["방문을 환영합니다~~"]},{"itemname":["게시판 주요 업무"],"row0":["01/19","금","서버 점검 시간 안내입니다.","8"],"row1":["01/05","수","사용법 안내 공지","7"],"row2":["12/22","목","이메일 관련 안내","6"],"row3":["10/10","토","2월 17일 일정 공지드립니다.","5"],"row4":["06/25","화","금일 오후 일정입니다.","4"]},{"itemname":["무재해 기록판"],"row0":[220],"row1":["2024년 01월 19일"],"row2":["3"],"row3":[1317],"row4":["2023년 06월 14일"],"row5":["2027년 01월 20일"]},{"itemname":["근무자 현황"],"row0":["웰시코기","웰시코기-인사과-과장.png","인사과","과장"],"row1":["판다","판다-마케팅팀-대리.jpg","마케팅팀","대리"],"row2":["거북이","거북이-개발팀-인턴.png","개발팀","인턴"],"row3":["아보카도","아보카도-경영팀-주임.png","경영팀","주임"]}],[{"itemname":["슬라이드 및 뉴스탭 설정"],"row0":[null],"row1":[null],"row2":[null]}]]}
                localStorage.setItem("json", JSON.stringify(json)) // 브라우저의 로컬 스토리지에 json 저장하기
//             }
//         })
    
//     // console.log(JSON.parse(localStorage.getItem('json')))
//     // localStorage.clear();
// }

// // fetch 시간 간격
// fetchJson(url);
// setInterval(()=>{
//     fetchJson(url)
// }, 600000)